/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hmiso <hmiso@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/12/21 12:59:36 by hmiso             #+#    #+#             */
/*   Updated: 2020/12/21 13:05:21 by hmiso            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <iostream>

int main()
{
	std::string str =  "HI THIS IS BRAIN";
	std::string *ptr = &str; // можно переопределять
	std::string &lnk = str; // нельзя переопределять

	std::cout << *ptr << std::endl;
	std::cout << lnk << std::endl;
}